Revit 2027 API
ParameterTypeId.AnalyticalElementPhysicalAsset Property
 "Physical Material Asset": Used for Analytical Elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalElementPhysicalAsset { get; }
Public Shared ReadOnly Property AnalyticalElementPhysicalAsset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalElementPhysicalAsset {
	ForgeTypeId^ get ();
}
static member AnalyticalElementPhysicalAsset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace